/**
 * @file        XC_Config.h
 * @brief       配置
 * @author      libertyzx (libertyzx@163.com)
 * @version     2.1.0
 * @date        2026/08/14
 * **********************************************
 * @copyright   Copyright (c) 2024 libertyzx. All rights reserved.
 * @license     This project is released under the MIT License.
 * **********************************************
 * @details     用于存放"XCOS"的配置参数;
 * **********************************************
 *  修改日志
 *  - 见"CHANGELOG.md"的更新说明;
 */
//=== 防重复定义
#ifndef XC_Config_h
#define XC_Config_h
//=== 头文件
#include <stddef.h>
#include <stdint.h>

//=== 全局配置
#ifdef XCOS_CFG
#include "XCOS_Cfg.h"
#endif

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 需要配置的参数

/**
 * @brief   [用户]嘀嗒计数数据类型
 * @details
 *  默认32位,用于系统滴答计数的数据
 *  一般不用改
 */
#ifndef XC_CFG_TICK_TYPE
#define XC_CFG_TICK_TYPE uint32_t
#endif

/**
 * @brief   [用户]嘀嗒计数数据类型定义
 * @details
 *  由"XC_CFG_TICK_TYPE"指定的类型定义出"XC_Tick_t";
 *  必须定义在本文件(最底层配置),供"XC_Config.h"的全局滴答计数声明及上层类型使用;
 */
typedef XC_CFG_TICK_TYPE XC_Tick_t;

/************************************************ 我是分割线 ************************************************/

/**
 * @brief   [内部]最大任务数
 * @details
 *  因为是协作式调度,任务数太多会导致每个任务运行卡顿;
 *  这个参数限制最大能注册的任务;
 *  数值范围:10~255;
 *  默认:100
 */
#ifndef XC_CFG_MAX_TASKS
#define XC_CFG_MAX_TASKS (100U)
#endif

/************************************************ 我是分割线 ************************************************/

/**
 * @brief   [内部]系统每秒滴答数(滴答计数频率)
 * @details
 *  单位Hz,是系统最小的时间单位;
 *  最大值是1000000Hz;对应时间是1us;
 *  一般设置1000,对应时间为1ms;
 */
#ifndef XC_CFG_TICKS_PER_SEC
#define XC_CFG_TICKS_PER_SEC (1000U)
#endif

/************************************************ 我是分割线 ************************************************/

/**
 * @brief   [内部]系统滴答计数实现
 * @details
 *  滴答计数是一个累加值,累加时间必须和"XC_CFG_TICKS_PER_SEC"时间一致;
 *  此值会在操作中被读取,作为时间计算的依据;
 *  系统滴答计数可用2种方式使用:
 *--- 方式1:中断累加形式(默认);
 *  用一个变量在定时器中累加,每一个滴答时间则+1;
 *  在此模式下,系统已经定义了一个全局变量"g_SysTickCount"(位于"XC_Sch.c"文件),
 *  并同时在本文件中做了"外部声明全局滴答时间计数";
 *  用户只需要做以下处理即可:
 *      1.创建定时器,按"XC_CFG_TICKS_PER_SEC"计数;
 *      2.在定时器中累加系统滴答计数,即调用"XC_AccSysTickCount()"函数;
 *--- 方式2:计数器形式;
 *  因为协程并不需要中断来切换上下文,所以为了使效率最高可以用一个计数器来做系统滴答计数;
 *  宏"XC_SYS_TICK_COUNT"作为一个计数器的函数的返回值(或其本身寄存器值);
 *  用户需要处理:
 *      1.创建定时器,按"XC_CFG_TICKS_PER_SEC"计数;
 *      2.将计数值作为"XC_SYS_TICK_COUNT"的指向;
 *  注意:
 *      计数器必须是32位计数器;
 *      宏"XC_SYS_TICK_COUNT"会频繁只读调用,注意寄存器读取效率;
 */
#ifndef XC_SYS_TICK_COUNT

#define XC_SYS_TICK_INT_INC_MODE          // [默认]以中断递增的模式形式
extern volatile XC_Tick_t g_SysTickCount; // 外部声明全局滴答时间计数
#define XC_SYS_TICK_COUNT g_SysTickCount  // 调用滴答时间计数

#endif

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 文件结束
#endif
