/**
 * @file        XC_Sch.h
 * @brief       调度器实现
 * @author      libertyzx (libertyzx@163.com)
 * @version     2.0.0
 * @date        2025/11/26
 * **********************************************
 * @copyright   Copyright (c) 2024 libertyzx. All rights reserved.
 * @license     This project is released under the MIT License.
 * **********************************************
 * @details     用于调度任务的代码
 * **********************************************
 *  修改日志
 *  - 见"CHANGELOG.md"的更新说明;
 */
//=== 防重复定义
#ifndef _XC_Sch_H_
#define _XC_Sch_H_
//=== 头文件
#include "XC_Type.h"

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
/** 函数声明-[用户]调度器处理 */

/**
 * @brief       [用户]调度器初始化
 * @param[in]   phXCOS  框架句柄
 * @details     在创建好"XCOS"句柄后,调用此函数初始化框架;
 */
void XCSch_Init(XC_OSHandle_t phXCOS);

/**
 * @brief       [用户]调度器启动(阻塞)
 * @param[in]   phXCOS  框架句柄
 * @details     阻塞的运行调度器,调用此函数后不会返回;
 */
void XCSch_Start(XC_OSHandle_t phXCOS);

/**
 * @brief       [用户]获取任务数
 * @param[in]   phXCOS  框架句柄
 * @return      uint8_t 返回任务数量
 * @details     当前框架中有多少任务;
 */
uint8_t XCSch_GetTaskNum(XC_OSHandle_t phXCOS);

/************************************************ 我是分割线 ************************************************/

/**
 * @brief       [用户]设置空闲处理回调
 * @param[in]   phXCOS  框架句柄
 * @param[in]   fIdle  框架空闲处理回调
 * @details
 *  用于设置框架空闲处理回调;
 *  若是需要清除回调则"fIdle"值为NULL即可;
 *  回调说明:
 *      简述: 框架空闲处理回调
 *      参数[in]: phXCOS    [XC_OSHandle_t]框架句柄
 *      参数[in]: IdleTick  [XC_Tick_t]空闲的Tick值(空闲多少个Tick)
 *      说明: 若是休眠,则需要"IdleTick"个Tick计数后唤醒;
 *          若是系统Tick计数也停止了则需要更新Tick值:
 *          - 系统Tick是定时器中断计数运行的,可以使用以下方式更新:
 *              ```
 *              XC_Tick_t Tick;
 *              Tick = XCTime_GetTick() + IdleTick;
 *              XCTime_TickSet(Tick)
 *              ```
 *          - 系统Tick是一个计数器,则计数器等于"XCTime_GetTick() + IdleTick";
 */
void XCSch_SetIdleCallback(XC_OSHandle_t phXCOS, void (*fIdle)(XC_OSHandle_t, XC_Tick_t));

/************************************************ 我是分割线 ************************************************/
/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 文件结束
#endif
