/**
 * @file        XC_Type.h
 * @brief       框架的类型
 * @author      libertyzx (libertyzx@163.com)
 * @version     2.0.0
 * @date        2026/01/05
 * **********************************************
 * @copyright   Copyright (c) 2024 libertyzx. All rights reserved.
 * @license     This project is released under the MIT License.
 * **********************************************
 * @details
 *  框架中用户调用的类型
 *  注意:"XC_Tick_t"类型特殊(可配置),在"XC_Config.h"中定义;
 * **********************************************
 *  修改日志
 *  - 见"CHANGELOG.md"的更新说明;
 */
//=== 防重复定义
#ifndef XC_Type_h
#define XC_Type_h
//=== 头文件
#include "Internal/XC_TypeInternal.h"

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
/** 枚举类型 */

/**
 * @brief   [用户]函数返回值
 */
typedef enum {
    XC_OK = 0,   // 成功
    XC_FAIL,     // 失败
    XC_CONTINUE, // 继续(异步操作)
} XC_Return_t;

/**
 * @brief   [用户]任务状态值
 */
typedef enum {
    XC_TASK_VOID = 0, // 空(任务创建前或被移除后的状态)
    XC_TASK_RUN,      // 运行(正在运行的任务)
    XC_TASK_READY,    // 就绪(在就绪表中的任务状态,任务注册后为就绪)
    XC_TASK_BLOCKED,  // 阻塞(延时,等待通知后的状态)
    XC_TASK_SUSPEND,  // 挂起
} XC_TaskState_t;

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */

/** 基础类型 */

/**
 * @brief   [用户]XCOS基础数据类型
 * @details
 *  默认32位,用于系统滴答计数的数据
 *  一般不用改
 */
/** "XC_Tick_t"在"XC_Config.h"文件定义 */

/**
 * [用户]软件定时器计数类型
 */
typedef struct {
    XC_Tick_t TickCount;
    XC_Tick_t WaitCount;
} XC_TimerTick_t;

/************************************************ 我是分割线 ************************************************/
/** 框架使用 */

/**
 * @brief   [用户]XCOS框架实例
 * @details
 *  用于记录XCOS实例的数据,一个工程中开源有多个XCOS实例,用此类型区分;
 */
typedef struct XCOS_t XCOS_t;

/**
 * @brief   [用户]XCOS框架句柄
 * @details
 *  不透明指针;
 *  对外提供的框架句柄指针,指向框架实例
 */
typedef XCOS_t* XC_OSHandle_t;

/************************************************ 我是分割线 ************************************************/
/** 任务控制块 */

/**
 * @brief   [用户]协程任务控制块(Task Control Block)的实例
 * @details
 *  用于记录任务控制相关的数据,每个任务都需要一个独立的TCB;
 */
typedef struct XC_TaskCB_t XC_TaskCB_t;

/**
 * @brief   [用户]任务句柄
 * @details
 *  不透明指针;
 *  对外提供的任务句柄指针,指向任务实例
 */
typedef XC_TaskCB_t* XC_TaskHandle_t;

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 文件结束
#endif
