/**
 * @file        XC_CorANSI.h
 * @brief       协程库(ANSI-C实现)
 * @author      libertyzx (libertyzx@163.com)
 * @version     0.3.0
 * @date        2023/12/21
 * **********************************************
 * @copyright   Copyright (c) 2018 libertyzx. All rights reserved.
 * @license     This project is released under the MIT License.
 * **********************************************
 * @details
 *  使用宏"__LINE__"来定义上下文断点;
 *  使用协程库后,每个文件代码行数不能超过65535;
 *  由"switch case"实现;
 * **********************************************
 *  修改日志
 *  - 2018/04/16
 *      - 版本:0.01
 *      - 从"SysFSM.h"V0.05 更新代码
 *  - 2022/08/15
 *      - 版本:0.02
 *      - "_COR_End"添加goto结束断点;
 *  - 2023/12/21
 *      - 增加"_COR_Break"直接跳出协程;
 */
/************************************************ 我是分割线 ************************************************/
//=== 防重复定义
#ifndef _XC_CorANSI_h_
#define _XC_CorANSI_h_

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
/** 数据类型 */

/**
 * @brief       协程断点类型
 * @details     用于断点时当前行书(__LINE__值)
 */
typedef unsigned short COR_BP_t;

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
/** 协程实现 */

/**
 * @brief       协程-断点初始化
 * @param[in]   BP  [COR_BP_t]协程断点
 * @details     初始化断点;
 */
#define _COR_Init(BP) ((BP) = 0)

/**
 * @brief       协程-代码开头
 * @param[in]   BP  [COR_BP_t]协程断点
 * @details     协程块的开始(状态机的开始);
 */
#define _COR_Start(BP) \
    switch((BP)) {     \
        case 0:

/**
 * @brief       协程-设置断点
 * @param[in]   BP  [COR_BP_t]协程断点
 * @details     将当前行号保存到断点中;
 */
#define _COR_SetBP(BP) \
    (BP) = __LINE__;   \
    case __LINE__:

/**
 * @brief       协程-跳出
 * @param[in]   BP  [COR_BP_t]协程断点
 * @details     直接跳出协程
 */
#define _COR_Break(BP) \
    goto _XCCOR_GOTO_End;

/**
 * @brief       协程-设置断点并跳出
 * @param[in]   BP  [COR_BP_t]协程断点
 * @details     将当前行号保存到断点中,然后跳出;
 */
#define _COR_SetBPBreak(BP) \
    (BP) = __LINE__;        \
    goto _XCCOR_GOTO_End;   \
    case __LINE__:

/**
 * @brief       协程-代码结束
 * @details     协程块的结束(状态机的结尾);
 */
#define _COR_End() \
    }              \
    _XCCOR_GOTO_End: /*结束跳转标志*/

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 文件结束
#endif
