/**
 * @file        XC_CorGNU.h
 * @brief       协程库(GNU-C实现)
 * @author      libertyzx (libertyzx@163.com)
 * @version     0.4.0
 * @date        2025/09/24
 * **********************************************
 * @copyright   Copyright (c) 2018 libertyzx. All rights reserved.
 * @license     This project is released under the MIT License.
 * **********************************************
 * @details
 *  在GUN环境下,使用"goto label"来实现协程;
 *  goto标签由"__func__"和"__LINE__"组合而成, 断点直接获取标签地址;
 *  使用"goto *标签地址"即可跳转到指定标签;
 *  使用协程库后,每个文件代码行数不能超过65535;
 * **********************************************
 *  修改日志
 *  - 2018/04/16
 *      - 版本:0.1
 *      - 初始编写
 *  - 2022/08/15
 *      - 版本:0.2
 *      - 修改断点在断点标号前加'_',为了防止数字开头的文件,导致标号不符合c语言规范;
 *      - "COR_End"添加goto结束断点;
 *  - 2023/12/21
 *      - 版本:0.3
 *      - 增加"COR_Break"直接跳出协程;
 *  - 2024/03/23
 *      - 版本:0.4
 *      - 删除宏中的"do{}while(0)"操作;
 */
//=== 防重复定义
#ifndef XC_CorGNU_h
#define XC_CorGNU_h

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
/** 数据类型 */

/**
 * @brief       协程断点类型
 * @details     用于保存断点的地址;
 */
typedef void* COR_BP_t;

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
/** 协程实现 */

//=== 基础函数宏 ==============================================================|

/**
 * @brief       [私有]协程-组合断点标志
 * @param[in]   S1  [字符]goto标签前缀
 * @param[in]   S1  [字符]goto标签后缀
 * @details
 *  使用了"##"字符连接符,所以展开需要2次才能得到标签;
 */
#define COR_BP2(S1, S2) S1##S2
#define COR_BP(S1, S2)  COR_BP2(S1, S2)

/**
 * @brief       协程-断点初始化
 * @param[in]   BP  [COR_BP_t]协程断点
 * @details     初始化断点;
 */
#define COR_Init(BP)    ((BP) = NULL)

/**
 * @brief       协程-代码开头
 * @param[in]   BP  [COR_BP_t]协程断点
 * @details     协程块的开始(状态机的开始);
 */
#define COR_Start(BP)    \
    {                    \
        if(BP != NULL) { \
            goto* BP;    \
        }                \
    }

/**
 * @brief       协程-设置断点
 * @param[in]   BP  [COR_BP_t]协程断点
 * @details     保存当前行的标签地址;
 */
#define COR_SetBP(BP)                        \
    {                                        \
        /*保存并设置断点(函数名+行号)*/      \
        (BP) = &&COR_BP(__func__, __LINE__); \
        COR_BP(__func__, __LINE__) :;        \
    }

/**
 * @brief       协程-跳出
 * @param[in]   BP  [COR_BP_t]协程断点
 * @details     直接跳出协程
 */
#define COR_Break(BP) \
    goto COR_GOTO_END;

/**
 * @brief       协程-设置断点并跳出
 * @param[in]   BP  [COR_BP_t]协程断点
 * @details     保存当前行的标签地址,然后跳出;
 */
#define COR_SetBPBreak(BP)                      \
    {                                           \
        /*保存并设置断点(函数名+行号)然后跳出*/ \
        (BP) = &&COR_BP(__func__, __LINE__);    \
        goto COR_GOTO_END;                      \
        COR_BP(__func__, __LINE__) :;           \
    }

/**
 * @brief       协程-代码结束
 * @details     协程块的结束(状态机的结尾);
 */
#define COR_End() \
    COR_GOTO_END: /*结束跳转标志*/

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 文件结束
#endif
