/**
 * @file        XC_TimeCompile.h
 * @brief       编译时间相关的数据
 * @author      libertyzx (libertyzx@163.com)
 * @version     1.00
 * @date        2024/08/12
 * **********************************************
 * @copyright   Copyright (c) 2024 libertyzx. All rights reserved.
 * @license     This project is released under the MIT License.
 * **********************************************
 * @details     编译时间格式化输出
 * **********************************************
 *  修改日志
 *  - 2024/08/12
 *      - 版本:1.00
 *      - 从"XC_Time.h"中独立出;
 */
/************************************************ 我是分割线 ************************************************/
//=== 防重复定义
#ifndef _XC_TimeCompile_H_
#define _XC_TimeCompile_H_

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
/** 编译时间相关 */

/**
 *  宏说明: \n
 *  宏"__DATE__"格式是:"MMM DD YYYY" 表示当前编译电脑的日期 \n
 *  如:
 *  > "Jan  8 2022"  //2022年8月8日
 *  > "Jan 18 2022"  //2022年8月18日
 *  月份值是:
 *  > 1月: Jan (January)
 *  > 2月: Feb (February)
 *  > 3月: Mar (March)
 *  > 4月: Apr (April)
 *  > 5月: May (May)
 *  > 6月: Jun (June)
 *  > 7月: Jul (July)
 *  > 8月: Aug (August)
 *  > 9月: Sep (September)
 *  > 10月:Oct (October)
 *  > 11月:Nov (November)
 *  > 12月:Dec (December)
 * ---
 *  宏"__TIME__"是时间,格式:"HH:MM:SS" 表示当前编译电脑的时间
 *  如:
 *  > 23:33:23    //23点33分23秒
 *  > 03:07:06    //3点7分6秒
 *  注意:
 *  > 年数字是4位10进制数据,需要16位宽及以上类型保存,
 *  > 其他(月日时分秒)都是2位10进制数据,需要8位宽及以上类型保存;
 */

/**
 * @brief       输出编译时的年
 * @return      int16_t     输出年的数字,如:2025
 * @details     获取在编译代码时的年份,是一个整型,需要16位变量存放;
 */
#define _Compile_GetYear  (((__DATE__[7] - '0') * 1000) + ((__DATE__[8] - '0') * 100) + ((__DATE__[9] - '0') * 10) + (__DATE__[10] - '0'))

/**
 * @brief       输出编译时的月份
 * @return      int8_t      输出月份的数字,如:12
 * @details
 *  获取在编译代码时的月份,是一个整型,需要8位变量存放;
 *  值为:1~12;
 */
#define _Compile_GetMonth (                                                     \
    __DATE__[2] == 'c' ? 12 : __DATE__[2] == 'v' ? 11                           \
                          : __DATE__[2] == 't'   ? 10                           \
                          : __DATE__[2] == 'p'   ? 9                            \
                          : __DATE__[2] == 'g'   ? 8                            \
                          : __DATE__[2] == 'l'   ? 7                            \
                          : __DATE__[2] == 'n'   ? (__DATE__[1] == 'u' ? 6 : 1) \
                          : __DATE__[2] == 'y'   ? 5                            \
                          : __DATE__[2] == 'r'   ? (__DATE__[1] == 'p' ? 4 : 3) \
                                                 : 2)

/**
 * @brief       输出编译时的日期
 * @return      int8_t      输出日期的数字,如:31
 * @details
 *  获取在编译代码时的日期,是一个整型,需要8位变量存放;
 *  值为:1~31;
 */
#define _Compile_GetDate        ((__DATE__[4] == ' ' ? 0 : (__DATE__[4] - '0')) * 10 + (__DATE__[5] - '0'))

/**
 * @brief       输出编译时的小时
 * @return      int8_t      输出小时的数字,如:23
 * @details
 *  获取在编译代码时的小时,是一个整型,需要8位变量存放;
 *  值为:0~23;
 */
#define _Compile_GetHour        (((__TIME__[0] - '0') * 10) + (__TIME__[1] - '0'))

/**
 * @brief       输出编译时的分钟
 * @return      int8_t      输出分钟的数字,如:59
 * @details
 *  获取在编译代码时的分钟,是一个整型,需要8位变量存放;
 *  值为:0~59;
 */
#define _Compile_GetMin         (((__TIME__[3] - '0') * 10) + (__TIME__[4] - '0'))

/**
 * @brief       输出编译时的秒
 * @return      int8_t      输出秒的数字,如:59
 * @details
 *  获取在编译代码时的秒,是一个整型,需要8位变量存放;
 *  值为:0~59;
 */
#define _Compile_GetSec         (((__TIME__[6] - '0') * 10) + (__TIME__[7] - '0'))

/**
 * @brief       获取一个编译日期时间的总字符串
 * @return      输出15字节的日期字符串数组,需要赋值给数组才能使用;
 * @details
 *  编译时间格式(年月是时分秒):20220803230638 \n
 *  大小是14个数字字符串+1个结束符,总共15个字节 \n
 *  使用方法: \n
 *  char a[] = _Compile_GetDateTimeStr;     //a是当前时间的字符串 \n
 *  如:"20251017034255"; \n
 */
#define _Compile_GetDateTimeStr {                                          \
    /*年*/ __DATE__[7], __DATE__[8], __DATE__[9], __DATE__[10],            \
    /*月*/ (_Compile_GetMonth / 10) + '0', (_Compile_GetMonth % 10) + '0', \
    /*日*/ (__DATE__[4] == ' ' ? '0' : '1'), __DATE__[5],                  \
    /*时*/ __TIME__[0], __TIME__[1],                                       \
    /*分*/ __TIME__[3], __TIME__[4],                                       \
    /*秒*/ __TIME__[6], __TIME__[7],                                       \
    /*结束*/ '\0'                                                          \
}

/**
 * @brief       获取十进制表示的日期
 * @return      int32_t     整型变量,输出10进制保存的日期数据
 * @details
 *  输出说明:
 *  2023年8月18号输出为十进制数据(8个数字):20230818
 */
#define _Compile_GetDateDec ((_Compile_GetYear * 100 + _Compile_GetMonth) * 100 + _Compile_GetDate)

/**
 * @brief       获取十进制表示的时间
 * @return      int32_t     整型变量,输出10进制保存的时间数据
 * @details
 *  输出说明:
 *  10点03分45秒输出为十进制数据(6个数字):100345
 */
#define _Compile_GetTimeDec ((_Compile_GetHour * 100 + _Compile_GetMin) * 100 + _Compile_GetSec)

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 文件结束
#endif
