/**
 * @file        XCOS.h
 * @brief
 * @author      libertyzx (libertyzx@163.com)
 * @version     2.00
 * @date        2025/10/20
 * **********************************************
 * @copyright   Copyright (c) 2024 libertyzx. All rights reserved.
 * @license     This project is released under the MIT License.
 * **********************************************
 * @details     头文件合并,使用时只要包含此文件即可;
 * **********************************************
 *  修改日志
 *  - 2024/03/19
 *      - 版本:1.00
 *      - 初始编写
 *  - 2025/10/20
 *      - 版本:2.00
 *      - 见"XC_UpdateInfo.md"的"T2025/10/20"更新说明;
 */
//=== 防重复定义
#ifndef _XCOS_h_
#define _XCOS_h_

/************************************************ 我是分割线 ************************************************/
//=== 头文件
#include "BinData.h"   //二进制值
#include "XC_Config.h" //配置

#include "XC_Sch.h"  //调度处理
#include "XC_Task.h" //任务处理
#include "XC_Time.h" //时间处理

//=== 标准库
// #include <stdarg.h>             //va_start & va_arg & va_end(可变参数用)
// #include <stdio.h>              //标准输入输出
// #include <string.h>             //标准字符串处理

/************************************************ 我是分割线 ************************************************/

/**说明详见"README.md"*/

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 文件结束
#endif
