/*=========================================================|
 | 文件名: XC_Core.h
 | 描述  : XCOS核心
 | 版本  : 1.00
 | 日期  : 2024/03/17
 | 语言  : C语言
 | 作者  : libertyzx
 | E-mail: libertyzx@163.com
 +-----------------------------------------------|
 | 开源协议: MIT License
 +-----------------------------------------------|
 +--- 说明
 |  核心处理
 +-----------------------------------------------|
 +--- 版本说明
 |  V1.00:-2024/03/17
 |      1.协程实现
 *========================================================*/
//=== 防重复定义
#ifndef _XC_Core_H_
#define _XC_Core_H_
//=== 头文件
#include "XC_Type.h"
#include "XC_Time.h"
#include "XC_List.h"

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */

/*协程底层实现("ANSI-C"和"GNU-C"区分)*/
#if( defined(__GNUC__) )
    #include "COR_GNU.h"                    //运行"GNU-C"库
#else
    #include "COR_ANSI.h"                   //运行"ANSI-C"库
#endif

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 宏/枚举 ===================================|
/**返回值*/
typedef enum{
    _XC_R_OK = 0,       //成功,没有问题
    _XC_R_Fail,         //失败
    _XC_R_Error,        //错误
    _XC_R_Timeout,      //超时
    _XC_R_Busy,         //忙
    _XC_R_Wait,         //等待
}TypeXC_Return;

/**状态值(当前协程状态)*/
typedef enum{
    _XC_S_Run = 0,  //正常运行
    _XC_S_Ready,    //就绪
    _XC_S_Blocking, //阻塞
}TypeXC_State;



/**阻塞类型*/
#define _XC_B_NonBlocked    (_B0000_0000)           //没有阻塞(清除阻塞)
#define _XC_B_Blocked       (_B0000_0001)           //阻塞
#define _XC_B_WaitTime      (_B0000_0010)           //等待时间


/**唤醒状态*/
#define _XC_Wake_Non        (0)         //无唤醒
#define _XC_Wake_Time       (1)         //时间到达唤醒
#define _XC_Wake_Notify     (2)         //通知到达唤醒

//=== 类型 ======================================|
typedef COR_BP_t XCBP_t;                //断点类型

/*协程任务控制块(Task Control Block)
 *  32位下占(16+4+4+4)+4
 */
typedef struct _XCTCB_t{
    XCListNode_t ListNode;              //链表节点

    void(*fTask)(struct _XCTCB_t*);     //函数运行入口
    XCBP_t BP;                          //协程断点(Break Point)
    XCVar_t NotifyData;                 //通知的数据
    uint8_t Blocked;                    //阻塞状态
    uint8_t WakeType;                   //任务唤醒的类型
    //===
}XCTCB_t;

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */

/*协程块*/

/************************************************|
 * 描述:    [协程]进入
 * 宏名:    XC_Enter
 * 参数[H]: XCTCB_t* ph     //控制块句柄
 * 返回:    void
 * 说明:    协程的启动处理;
 *  必须搭配"XC_Leave"使用;
 ************************************************/
#define XC_Enter(_ph)   \
{   \
    /*全局变量转局部变量可加快运行速度*/                \
    XCTCB_t *_phXCTCB = (_ph);          /*得到PCB*/     \
    XCBP_t   _XCPB    = _phXCTCB->BP;   /*得到断点*/    \
    /*启动协程*/                                        \
    _COR_Start(_XCPB);                  /*启动*/        \

/************************************************|
 * 描述:    [协程]离开
 * 宏名:    XC_Leave
 * 参数[N]: void
 * 返回:    void
 * 说明:    协程块结束;
 *  必须搭配"XC_Enter"使用;
 ************************************************/
#define XC_Leave()  \
    _COR_End();     /*结束*/    \
}

/************************************************ 我是分割线 ************************************************/

/**协程控制*/

/************************************************|
 * 描述:    [协程]让出控制
 * 宏名:    XC_Yield
 * 参数[N]: void
 * 返回:    void
 * 说明:    让出CPU的使用权,跳出协程,下次从此处继续;
 *  必须在协程块中使用;
 ************************************************/
#define XC_Yield()          _COR_SetBPBreak(_XCPB)  /*设置断点并跳出*/

/************************************************|
 * 描述:    [协程]延时Tick
 * 宏名:    XC_DelayTick
 * 参数[N]: _n
 * 返回:    void
 * 说明:    让出CPU的使用权,延时_n个基础时钟;
 *  必须在协程块中使用;
 ************************************************/
#define XC_DelayTick(_n)    \
{   \
    _phXCTCB->WakeType = _XC_Wake_Non;                          \
    _phXCTCB->Blocked  = _XC_B_WaitTime;    /*等待时间*/        \
    _phXCTCB->ListNode.Value = (_n);        /*保存时间*/        \
    _COR_SetBPBreak(_XCPB);                 /*设置断点并跳出*/  \
}

/************************************************|
 * 描述:    [协程]延时
 * 宏名:    XC_Delay_**
 * 参数[N]: _n
 * 返回:    void
 * 说明:    让出CPU的使用权,延时_n个时间;
 *  必须在协程块中使用;
 *  注意:us延时必须要Tick计数在us时基上才能准确的调用;
 ************************************************/
#define XC_Delay_us(_n)     XC_DelayTick(_Time_us2Tick(_n))
#define XC_Delay_ms(_n)     XC_DelayTick(_Time_ms2Tick(_n))
#define XC_Delay_s(_n)      XC_DelayTick(_Time_s2Tick(_n))
#define XC_Delay_min(_n)    XC_DelayTick(_Time_min2Tick(_n))
#define XC_Delay_h(_n)      XC_DelayTick(_Time_h2Tick(_n))
#define XC_Delay_day(_n)    XC_DelayTick(_Time_day2Tick(_n))

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//任务通知处理

/************************************************|
 * 描述:    [协程]等待通知
 * 宏名:    XC_NotifyTake
 * 参数[I]: XCuint_t TickTimeout    //超时时间
 *  +=参数
 *  | 0     //阻塞死等
 *  | >0    //超时时间
 * 返回:    void
 * 说明:    等待一个通知;
 *  必须在协程块中使用;
 ************************************************/
#define XC_WaitNotify(_TickTimeout) \
{   \
    _phXCTCB->WakeType = _XC_Wake_Non;                      \
    _phXCTCB->Blocked  = _XC_B_Blocked | _XC_B_WaitTime;    \
    _phXCTCB->ListNode.Value = (_TickTimeout);              \
    _COR_SetBPBreak(_XCPB);     /*设置断点并跳出*/          \
}

/************************************************|
 * 描述:    [协程]获取通知超时
 * 宏名:    XC_GetNotifyTimeout
 * 参数[N]: void
 * 返回:    boot        //通知状态
 *  +=返回值
 *  |   1   //超时
 *  |   0   //没有超时
 * 说明:
 *  适用于到超时的通知;
 *  通知唤醒后获取通知是否超时;
 *  必须在协程块中使用;
 ************************************************/
#define XC_GetNotifyState()     (_phXCTCB->WakeType == _XC_Wake_Time)

/************************************************|
 * 描述:    [协程]获取通知的数据
 * 宏名:    XC_GetNotifyData
 * 参数[N]: void
 * 返回:    XCVar_t //得到通知的数据
 * 说明:
 *  通知唤醒后获取通知传递的数据
 *  必须在协程块中使用;
 ************************************************/
#define XC_GetNotifyData()      (_phXCTCB->NotifyData)

/**任务通知的函数声明*/

//发送通知
void XC_SendNotify(XCOS_t* phXCOS, XCTCB_t* phTCB, XCVar_t NotifyData);







/************************************************ 我是分割线 ************************************************/

/************************************************|
 * 描述:    [协程]初始化
 * 宏名:    XC_Init
 * 参数[H]: XCTCB_t* ph     //控制块句柄
 * 返回:    void
 * 说明:
 ************************************************/


/*协程控制*/

/************************************************|
 * 描述:    [协程]运行协程
 * 宏名:    _XC_Run
 * 参数[H]: HandleXC_PCB* _ph
 * 返回:    void
 * 说明:    运行指定协程
 ************************************************/
#define _XC_Run(_ph)

/************************************************|
 * 描述:    [协程]停止协程
 * 宏名:    _XC_Stop
 * 参数[H]: HandleXC_PCB* _ph
 * 返回:    void
 * 说明:    停止指定协程
 ************************************************/
#define _XC_Stop(_ph)



/************************************************ 我是分割线 ************************************************/
/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 文件结束
#endif
