/*=========================================================|
 | 文件名:  XC_List.h
 | 描述:    定义所有链表操作
 | 版本:    V1.00
 | 日期:    2024/03/05
 | 语言:    C语言
 | 作者:    libertyzx
 | E-mail:  libertyzx@163.com
 +-----------------------------------------------|
 | 开源协议: MIT License
 +-----------------------------------------------|
 +--- 说明
 |  XCOS中需要的链表操作
 +-----------------------------------------------|
 +--- 版本说明:
 |  V1.00:-2024/03/05
 |      1.初始化
 *========================================================*/
//=== 防重复定义
#ifndef _XC_List_H_
#define _XC_List_H_
//=== 头文件
#include "XC_Type.h"

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 数据类型 ===========================================|

/**双向链表节点
 *  32位下占16字节;
 */
typedef struct _XCListNode_t{
    struct _XCListNode_t* pNext;            //指向下个节点
    struct _XCListNode_t* pPrevious;        //指向上个节点
    XCuint_t Value;                         //辅助值,用于排序
    struct _XCListRoot_t* pRootList;        //指向节点所属的地址
}XCListNode_t;

/**基础双向链表数据类型
 *  只有链表节点和辅助值;
 *  32位下占12字节;
 */
typedef struct{
    XCListNode_t* pNext;                    //指向下个节点
    XCListNode_t* pPrevious;                //指向上个节点
    XCuint_t Value;                         //辅助值,用于排序
}XCListBasic_t;

/**双向链表根节点类型
 *  32位下占16字节;
 */
typedef struct _XCListRoot_t{
    XCListBasic_t RootNode;                 //根节点,最后/最初的节点
    uint32_t ListNodeNum;                   //当前链表总节点数,不含根接点
}XCListRoot_t;

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 函数宏 =============================================|

/************************************************|
 * 描述:    [宏]将新节点插入旧节点之前
 * 宏名:    _XCList_InsertPrevious
 * 形参[I]: _pListNode      //要插入的节点指针
 * 形参[I]: _pNewNode       //新节点指针
 * 返回:    无
 * 说明:    只插入节点;
 * 例程:    无
 ************************************************/
#define XCList_InsertPrevious(_pListNode, _pNewNode)    \
{                                                       \
    (_pNewNode)->pNext     = (_pListNode);              \
    (_pNewNode)->pPrevious = (_pListNode)->pPrevious;   \
    (_pListNode)->pPrevious->pNext = (_pNewNode);       \
    (_pListNode)->pPrevious        = (_pNewNode);       \
}

/************************************************|
 * 描述:    [宏]将新节点插入旧节点之后
 * 宏名:    _XCList_InsertNext
 * 形参[I]: _pListNode      //要插入的节点指针
 * 形参[I]: _pNewNode       //新节点指针
 * 返回:    无
 * 说明:    只插入节点;
 * 例程:    无
 ************************************************/
#define XCList_InsertNext(_pListNode, _pNewNode)            \
{                                                           \
    (_pNewNode)->pNext            = (_pListNode)->pNext;    \
    (_pNewNode)->pNext->pPrevious = (_pNewNode);            \
    (_pNewNode)->pPrevious        = (_pListNode);           \
    (_pListNode)->pNext           = (_pNewNode);            \
}

/************************************************|
 * 描述:    [宏]连接2个节点
 * 宏名:    _XCList_LinkNode
 * 形参[I]: _pPreviousNode  //上个节点
 * 形参[I]: _pNextNode      //下个节点
 * 返回:    无
 * 说明:    这将删除2个节点间所有节点;
 * 例程:    无
 ************************************************/
#define XCList_LinkNode(_pPreviousNode, _pNextNode)     \
{                                                       \
    (_pNextNode)->pPrevious = (_pPreviousNode);         \
    (_pPreviousNode)->pNext = (_pNextNode);             \
}

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 函数声明 ===========================================|

//初始化
void XCList_Init(XCListRoot_t* pList);      //初始化链表
void XCList_InitNode(XCListNode_t* pNode);  //初始化节点

//节点插入
void XCList_InsertStart(XCListRoot_t* pList, XCListNode_t* pNewNode);   //插入开始
void XCList_InsertEnd(XCListRoot_t* pList, XCListNode_t* pNewNode);     //插入结尾
void XCList_InsertAsc(XCListRoot_t* pList, XCListNode_t* pNewNode);     //升序排列的插入节点

//节点移除
void XCList_Remove(XCListNode_t* pNode);    //从链表中移除一个节点

//其他操作
void XCList_SwapList(XCListRoot_t* pList1, XCListRoot_t* pList2);   //交换2个链表

/************************************************ 我是分割线 ************************************************/
/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 文件结束
#endif
