/*=========================================================|
 | 文件名:  XC_Task.c
 | 描述:    任务的实现
 | 版本:    V1.00
 | 日期:    2024/03/18
 | 语言:    C语言
 | 作者:    libertyzx
 | E-mail:  libertyzx@163.com
 +-----------------------------------------------|
 | 开源协议: MIT License
 +-----------------------------------------------|
 +--- 说明
 |  1.实现了所有协程相关的操作;
 |  2.实现了任务处理需要的操作;
 +-----------------------------------------------|
 +--- 版本说明:
 |  V1.00:-2024/03/18
 |      1.初始化
 *========================================================*/
//=== 头文件
#include "XC_Task.h"
#include "XC_Sch.h"

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
/**任务通知的用户函数*/

/************************************************|
 * 描述:    发送通知
 * 函数名:  XC_SendNotify
 * 参数[I]: XCTCB_t* phTCB      //通知的任务
 * 参数[I]: XCVar_t NotifyData  //通知传递的数据
 * 返回:    uint32_t            //状态
 *  +=说明
 *  | 0     //成功
 *  | 1     //任务运行中(在就绪表)
 * 说明:
 *  发送通知,唤醒任务;
 *  不可在中断中调用;
 ************************************************/
uint32_t XC_SendNotify(XCTCB_t* phTCB, uint32_t NotifyData)
{
    //在就绪表
    if(phTCB->ListNode.pRootList == &phTCB->phXCOS->ReadyList){
        return(1);
    }

    XCSch_ListNodeRemove(phTCB->phXCOS, phTCB);                 //删除任务
    XCSch_ListNodeInsertIndexPrevious(phTCB->phXCOS, phTCB);    //插入就续表
    phTCB->NotifyData = NotifyData;
    phTCB->State      = _XC_S_Ready;
    /*这里不处理时间表*/
    return(0);
}

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 任务挂起&恢复

/************************************************|
 * 描述:    任务挂起
 * 函数名:  XC_TaskSuspend
 * 参数[I]: XCTCB_t* phTCB      //任务TCB
 * 返回:    void
 * 说明:
 *  挂起一个任务;
 *  不可在中断中调用;
 ************************************************/
void XC_TaskSuspend(XCTCB_t* phTCB)
{
    if(phTCB->State == _XC_S_Suspend){
        return;                         //已经被挂起
    }
    XCSch_ListNodeRemove(phTCB->phXCOS, phTCB);                         //删除任务
    XCList_InsertEnd(&phTCB->phXCOS->BlockedList, &phTCB->ListNode);    //插入阻塞表
    phTCB->State = _XC_S_Suspend;       //挂起态
}

/************************************************|
 * 描述:    任务恢复
 * 函数名:  XC_TaskResume
 * 参数[I]: XCTCB_t* phTCB      //任务TCB
 * 返回:    void
 * 说明:
 *  恢复一个任务;
 *  不可在中断中调用;
 ************************************************/
void XC_TaskResume(XCTCB_t* phTCB)
{
    if(phTCB->State != _XC_S_Suspend){
        return;
    }
    XCSch_ListNodeRemove(phTCB->phXCOS, phTCB);                 //删除任务
    XCSch_ListNodeInsertIndexPrevious(phTCB->phXCOS, phTCB);    //插入就续表
    phTCB->State = _XC_S_Ready;     //就绪态
}

/************************************************ 我是分割线 ************************************************/
/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
