/*=========================================================|
 | 文件名: XC_Type.h
 | 描述  : 类型定义
 | 版本  : V1.00
 | 日期  : 2024/02/26
 | 语言  : C语言
 | 作者  : libertyzx
 | E-mail: libertyzx@163.com
 +-----------------------------------------------|
 | 开源协议: MIT License
 +-----------------------------------------------|
 +--- 说明
 |  XCOS中需要使用的类型
 +-----------------------------------------------|
 +--- 版本说明:
 |  V1.00:-2024/02/26
 |      1.由"XCBase"库中"Macro.h"(V0.32)更新的类型
 |      2.删除了一些不常使用的类型;修正类型描述错误;
 *========================================================*/
//=== 防重复定义
#ifndef _XC_Type_H_
#define _XC_Type_H_
//=== 头文件
#include <stddef.h>
#include <stdint.h>
#include "XC_Cnf.h"
#include "XC_CPU.h"
#include "BinData.h"

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */

//=== 数据类型宏-C标准(通用) ==============================|

/****数据类型宏定义
 * volatile     定义变量, 不会因为编译器优化而忽略
 * const        定义变量, 限定一个变量不允许被改变
 * register     定义变量, 内部寄存器变量, 速度快
 * char         固定8字节;
 * short        固定2字节;
 * long         类型在8/16/32位机下是4字节,64位机下是8字节;
 * int          类型在8/16位机下是2字节,在32/64位机下是4字节;
 * long long    类型固定8字节;
 * 指针类型固定是cpu位数的长度
 */
#define __RW  volatile          //可读写
#define __R   volatile const    //只读
#define __W   volatile          //只写
#define __REG register          //寄存器变量

/*基础类型*/

//有符号数据
typedef signed char             schar;
typedef signed short            sshort;
typedef signed int              sint;
typedef signed long             slong;

//无符号数据
typedef unsigned char           uchar;
typedef unsigned short          ushort;
typedef unsigned int            uint;
typedef unsigned long           ulong;

//=== 数据类型宏-C标准(32位MUC-定义64位数据) ==============|
#if(_CPUbit >= (32) )
    typedef unsigned long long  ullong;             //无符号64位数据
    typedef signed long long    sllong;             //有符号64位数据
    typedef long long           llong;              //有符号64位数据
#endif

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */

//=== 数据类型扩展-C标准(通用) ============================|

/*扩展bool类型-因为某些库里面已经定定义所以这里不重新定义*/

//当前文件当前"__LINE"宏所在的行号(是数字)
    #ifndef _LINE
        #define _LINE              __LINE__
    #endif
//当前文件的文件名(是字符串首地址)
    #ifndef _FILE
        #define _FILE              __FILE__
    #endif

//扩展使能&除能类型-通用
typedef enum {_DI = 0, _EN = !_DI}TypeDevSW;
#define _H      _EN
#define _L      _DI

//空指针定义
#ifndef NULL
    #define NULL    ((void*)(0))
#endif
#ifndef Null
    #define Null    ((void*)(0))
#endif
#ifndef null
    #define null    ((void*)(0))
#endif

//不使用参数配置
#define _Unused(x)  do{ ((void)(x)); }while(0)      //设置不使用的变量

/**数据类型集合
 *  变量类型,在32位数据下为32位大小
 *  主要是由指针类型长度决定
 */
typedef union{
    uint8_t Byte;
    char c;

    int8_t  S8;
    int16_t S16;
    int32_t S32;

    uint8_t U8;
    uint16_t U16;
    uint32_t U32;

    float F32;

    void* p;
}XCVar_t;

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */


//=== 文件结束
#endif
