/*=========================================================|
 | 文件名:  XC_Task.c
 | 描述:    任务的实现
 | 版本:    V1.01
 | 日期:    2024/04/09
 | 语言:    C语言
 | 作者:    libertyzx
 | E-mail:  libertyzx@163.com
 +-----------------------------------------------|
 | 开源协议: MIT License
 +-----------------------------------------------|
 +--- 说明
 |  1.实现了所有协程相关的操作;
 |  2.实现了任务处理需要的操作;
 +-----------------------------------------------|
 +--- 版本说明:
 |  V1.00:-2024/03/18
 |      1.初始化
 |  V1.01:-2024/04/09
 |      1."XC_SendNotify"函数形参通知数据改为"void*"指针;
 |      2."XC_TaskBasicInit"函数增加传入形参初始化;
 *========================================================*/
//=== 头文件
#include "XC_Task.h"
#include "XC_Sch.h"

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
/**基本操作函数*/

/************************************************|
 * 描述:    [内部]任务基本初始化
 * 函数名:  XC_TaskBasicInit
 * 参数[I]: XCTCB_t* phTCB      //任务TCB
 * 返回:    void
 * 说明:
 *  用户不调用;
 *  "TCB"中以下数据不会被初始化:
 *      "ListNode"      //链表节点
 *      "phXCOS"        //任务所属的框架句柄
 *      "fTask"         //任务入口
 *      "Param"         //传递给任务的参数
 *      "TaskState"     //任务状态
 ************************************************/
void XC_TaskBasicInit(XCTCB_t* phTCB)
{
    phTCB->TaskWakeTick = ~0;                   //任务下个唤醒的时间
    _COR_Init(phTCB->BP);                       //初始化断点
    phTCB->NotifyData = 0;                      //通知数据清零
    phTCB->Blocked = _XC_B_NonBlocked;          //没有阻塞
    phTCB->WakeType = _XC_Wake_Non;             //没有唤醒
}

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
/**任务通知的用户函数*/

/************************************************|
 * 描述:    发送通知
 * 函数名:  XC_SendNotify
 * 参数[I]: XCTCB_t* phTCB      //通知的任务
 * 参数[I]: void* pNotifyData   //通知传递的数据
 * 返回:    int32_t
 *  +=说明
 *  | _XC_R_OK          //通知成功
 *  | _XC_R_Continue    //任务已经唤醒(已在就绪表)
 *  | _XC_R_Fail        //任务被挂起
 * 说明:
 *  发送通知,唤醒任务;
 *  只有在任务成功被通知(_XC_R_OK)时,传递的数据才有效;
 *  不可在中断中调用;
 ************************************************/
int32_t XC_SendNotify(XCTCB_t* phTCB, void* pNotifyData)
{
    /**无效处理
     *  只处理发送通知本身的唤醒,若是状态被改变则不处理;
     *  目前状态会被任务挂起所更新,更新为"_XC_S_Suspend";
     */
    if(phTCB->TaskState != _XC_S_WaitNotify){
        return(_XC_R_Fail);
    }

    //在就绪表
    if(phTCB->ListNode.pRootList == &phTCB->phXCOS->ReadyList){
        return(_XC_R_Continue);
    }
    XCSch_ListOperationStart(phTCB->phXCOS);    //链表操作开始
    XCSch_ListNodeRemove(phTCB);                //删除任务
    XCSch_ListNodeInsertIndexPrevious(phTCB);   //插入就续表
    phTCB->pNotifyData = pNotifyData;           //传递的通知数据
    phTCB->WakeType  = _XC_Wake_Notify;         //被通知唤醒
    phTCB->TaskState = _XC_S_Ready;             //任务状态:就绪
    XCSch_ListOperationEnd(phTCB->phXCOS);      //链表操作结束
    /*这里不处理时间表*/
    return(_XC_R_OK);
}

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 任务挂起&恢复

/************************************************|
 * 描述:    任务挂起
 * 函数名:  XC_TaskSuspend
 * 参数[I]: XCTCB_t* phTCB      //任务TCB
 * 返回:    int32_t
 *  +=说明
 *  | _XC_R_OK          //挂起成功
 *  | _XC_R_Continue    //已经被挂起
 * 说明:
 *  不可在中断中调用;
 *  将任务挂起,本次任务运行完成后暂停任务;
 *  挂起可以覆盖任务的所有阻塞状态,优先级最高;
 *  挂起后只能被恢复任务解锁;
 *  任务解锁后原先的阻塞将失效,
 *  并以"_XC_Wake_TaskResume"作为唤醒类型继续运行;
 ************************************************/
int32_t XC_TaskSuspend(XCTCB_t* phTCB)
{
    if(phTCB->TaskState == _XC_S_Suspend){
        return(_XC_R_Continue);         //已经被挂起
    }
    XCSch_ListOperationStart(phTCB->phXCOS);                            //链表操作开始
    phTCB->TaskState = _XC_S_Suspend;                                   //任务状态:挂起
    XCSch_ListNodeRemove(phTCB);                                        //删除任务
    XCList_InsertEnd(&phTCB->phXCOS->BlockedList, &phTCB->ListNode);    //插入阻塞表
    XCSch_ListOperationEnd(phTCB->phXCOS);                              //链表操作结束
    return(_XC_R_OK);
}

/************************************************|
 * 描述:    任务恢复
 * 函数名:  XC_TaskResume
 * 参数[I]: XCTCB_t* phTCB      //任务TCB
 * 返回:    int32_t
 *  +=说明
 *  | _XC_R_OK          //恢复成功
 *  | _XC_R_Continue    //任务没有挂起
 * 说明:
 *  不可在中断中调用;
 *  只能恢复被挂起的任务;
 ************************************************/
int32_t XC_TaskResume(XCTCB_t* phTCB)
{
    if(phTCB->TaskState != _XC_S_Suspend){
        return(_XC_R_Continue);                 //没有被挂起
    }
    XCSch_ListOperationStart(phTCB->phXCOS);    //链表操作开始
    XCSch_ListNodeRemove(phTCB);                //删除任务
    XCSch_ListNodeInsertIndexPrevious(phTCB);   //插入就续表
    phTCB->WakeType  = _XC_Wake_TaskResume;     //被任务恢复唤醒
    phTCB->TaskState = _XC_S_Ready;             //任务状态:就绪
    XCSch_ListOperationEnd(phTCB->phXCOS);      //链表操作结束
    return(_XC_R_OK);
}

/************************************************ 我是分割线 ************************************************/
/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
