/*=========================================================|
 | 文件名:  CortexMx.h
 | 描述:    对应CortexMx使用的宏定义
 | 版本:    V0.01
 | 日期:    2023/12/10
 | 语言:    C语言
 | 作者:    libertyzx
 | E-mail:  libertyzx@163.com
 +-----------------------------------------------|
 +--- 说明
 |  1.配置位段和基础调试时钟
 +-----------------------------------------------|
 +--- 版本说明
 |  V0.01:-2023/12/10
 |      1.初始化
 *========================================================*/
//=== 防重复定义
#ifndef _CortexMx_H_
#define _CortexMx_H_
//=== 头文件

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
/**位段处理*/

//位段处理-寄存器中
#define _BitField_RegAddr(_Addr, _Bit)  (0x42000000 + (((ulong)(_Addr))-0x40000000)*32 + (_Bit)*4)  //寄存器位段地址
#define _BitField_RegData(_Addr, _Bit)  (*((__RW ulong*)(_BitField_RegAddr(_Addr, _Bit))))          //寄存器位段值
//位段处理-内存中
#define _BitField_SRAMAddr(_Addr, _Bit) (0x22000000 + (((ulong)(_Addr))-0x20000000)*32 + (_Bit)*4)  //内存位段地址
#define _BitField_SRAMData(_Addr, _Bit) (*((__RW ulong*)(_BitField_SRAMAddr(_Addr, _Bit))))         //内存位段值

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */

/**内核调试计数器
 *  注意:需要调用此处函数,文件包含的时候,
 *  "core_cm*.h"文件需要在"CortexMx.h"前包含;
 *  一般"core_cm*.h"文件已经包含在芯片给的驱动库中;
 */
#if( defined(CoreDebug_BASE) && defined(DWT_BASE) )

/************************************************|
 * 描述:    内核调试计数器初始化
 * 函数名:  DWT_CountInit
 * 参数[N]: void
 * 返回:    int     //返回状态:0成功;-1失败;
 * 说明:    Cortex核心调试模块;
 *  启动后"DWT->CYCCNT"是系统时钟计数;
 ************************************************/
__STATIC_INLINE int DWT_CountInit(void)
{
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;    //0x01000000;
    if((CoreDebug->DEMCR & CoreDebug_DEMCR_TRCENA_Msk) != CoreDebug_DEMCR_TRCENA_Msk){
        return(-1);
    }

    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
    if((DWT->CTRL & DWT_CTRL_CYCCNTENA_Msk) != DWT_CTRL_CYCCNTENA_Msk){
        return(-1);
    }
    return(0);
}

/************************************************|
 * 描述:    内核调试计数器延时us
 * 函数名:  DWT_Delay_us
 * 参数[I]: unsigned long us
 * 返回:    void
 * 说明:    Cortex核心调试模块;产生us延时;
 *  因为是死循环延时,不建议长延时调用,且记得注意看门狗;
 ************************************************/
__STATIC_INLINE void DWT_Delay_us(unsigned long us)
{
    register unsigned long Count;
    register unsigned long Diff;
    extern unsigned int SystemCoreClock;

    Count = DWT->CYCCNT;
    Diff  = (SystemCoreClock / 1000000) * us;
    while((DWT->CYCCNT-Count) < Diff);
}

#endif

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 文件结束
#endif
