/*=========================================================|
 | 文件名: XC_BitFlag.h
 | 描述  : 位标志实现
 | 版本  : V1.00
 | 日期  : 2024/03/20
 | 语言  : C语言
 | 作者  : libertyzx
 | E-mail: libertyzx@163.com
 +-----------------------------------------------|
 | 开源协议: MIT License
 +-----------------------------------------------|
 +--- 说明
 |  实现位标志的创建删除获取等操作;
 +-----------------------------------------------|
 +--- 版本说明:
 |  V1.00:-2024/03/20
 |      1.初始化,由"Mark.h"V0.04修改;
 *========================================================*/
//=== 防重复定义
#ifndef _XC_BitFlag_H_
#define _XC_BitFlag_H_
//=== 头文件
#include <string.h>
#include "XC_MacroFunc.h"

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */

/**创建位标志*/

/************************************************|
 * 描述:    [宏]新建位标志变量
 * 宏名:    XCBitFlag_New
 * 形参[I]: _Name       //新建位标志变量名称
 * 形参[I]: _Num        //当前位标志变量包含多少个位标志(任意值)
 * 返回:    无
 * 说明:
 *  "XCBitFlag_New"本质是一个变量定义,所以需要遵循C的变量定义规范;
 *  标志是按字节对齐的,数量1-8个数量实际是使用的一个字节(按位处理);
 *  "XCBitFlag_New"标志默认初始化为0(无标志);
 *  "XCBitFlag_new"不初始化;
 * 例程:    无
 ************************************************/
#define XCBitFlag_New(_Name, _Num)          uint8_t _Name[((_Num)+7)/8] = {0}   //初始化为0
#define XCBitFlag_new(_Name, _Num)          uint8_t _Name[((_Num)+7)/8]         //不初始化

/************************************************|
 * 描述:    [宏]引用外部位标志变量
 * 宏名:    XCBitFlag_Extern
 * 形参[I]: _Name       //位标志变量名称
 * 形参[I]: _Num        //位标志变量包含多少个位标志(需要和定义相同)
 * 返回:    无
 * 说明:
 *  位变量为全局变量,且其他文件需要使用时,用此函数引用;
 * 例程:    无
 ************************************************/
#define XCBitFlag_Extern(_Name, _Num)       extern uchar _Name[((_Num)+7)/8]

/************************************************ 我是分割线 ************************************************/
/**位变量操作*/

/************************************************|
 * 描述:    [宏]设置标志位
 * 宏名:    XCBitFlag_Set
 * 形参[I]: _Name       //位标志变量名称
 * 形参[I]: _ID         //标志ID(0~(设定数量-1))
 * 返回:    无
 * 说明:
 *  将对应"位标志ID"写1;
 *  注意:这里不判断"位标志ID"是否在设置范围内;
 * 例程:    无
 ************************************************/
#define XCBitFlag_Set(_Name, _ID)           (_Name[(_ID)/8] |= (1<<((_ID)%8)))

/************************************************|
 * 描述:    [宏]清除标志位
 * 宏名:    XCBitFlag_Clr
 * 形参[I]: _Name       //位标志变量名称
 * 形参[I]: _ID         //标志ID(0~(设定数量-1))
 * 返回:    无
 * 说明:
 *  将对应"位标志ID"清0;
 *  注意:这里不判断"位标志ID"是否在设置范围内;
 * 例程:    无
 ************************************************/
#define XCBitFlag_Clr(_Name, _ID)           (_Name[(_ID)/8] &= (~(1<<((_ID)%8))))

/************************************************|
 * 描述:    [宏]获取标志位
 * 宏名:    XCBitFlag_Get
 * 形参[I]: _Name       //位标志变量名称
 * 形参[I]: _ID         //标志ID(0~(设定数量-1))
 * 返回:    bool
 *  +=返回
 *  | 0: 当前ID无标志
 *  | 1: 当前ID有标志
 * 说明:
 *  获取对应"位标志ID"是否被设置标志;
 *  注意:这里不判断"位标志ID"是否在设置范围内;
 * 例程:    无
 ************************************************/
#define XCBitFlag_Get(_Name, _ID)           (!!(_Name[(_ID)/8] & (1<<((_ID)%8))))

/************************************************|
 * 描述:    [宏]设置全部标志位
 * 宏名:    XCBitFlag_SetAll
 * 形参[I]: _Name       //位标志变量名称
 * 返回:    无
 * 说明:
 *  将全部"位标志ID"写1;
 * 例程:    无
 ************************************************/
#define XCBitFlag_SetAll(_Name)             memset((void*)(_Name), 0xFF, _ArraySize(_Name))

/************************************************|
 * 描述:    [宏]清除全部标志位
 * 宏名:    XCBitFlag_ClrAll
 * 形参[I]: _Name       //位标志变量名称
 * 返回:    无
 * 说明:
 *  将全部"位标志ID"写0;
 * 例程:    无
 ************************************************/
#define XCBitFlag_ClrAll(_Name)             memset((void*)(_Name), 0x00, _ArraySize(_Name))


/************************************************|
 * 描述:    [宏]判断是否有标志
 * 宏名:    XCBitFlag_Check
 * 形参[I]: _Name       //位标志变量名称
 * 返回:    boot
 *  +=返回
 *  | 0     //没有任何标志
 *  | 1     //有一个或多个标志
 * 说明:
 *  判断位标志是否为空
 * 例程:    无
 ************************************************/
__STATIC_INLINE int32_t _XCBitFlag_Check_(uint8_t Name[], uint32_t Num)
{
    while(Num--){
        if(*Name++ != 0){
            return(1);
        }
    }
    return(0);
}
#define XCBitFlag_Check(_Name)              _XCBitFlag_Check_(_Name, _ArraySize(_Name))


/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 文件结束
#endif
