/**
 * @file        XC_Cnf.h
 * @brief       配置
 * @author      libertyzx (libertyzx@163.com)
 * @version     2.00
 * @date        2025/10/30
 * **********************************************
 * @copyright   Copyright (c) 2024 libertyzx. All rights reserved.
 * @license     This project is released under the MIT License.
 * **********************************************
 * @details     用于存放"XCOS"的配置参数;
 * **********************************************
 *  修改日志
 *  - 见"XC_UpdateInfo.md"的更新说明;
 */
//=== 防重复定义
#ifndef _XC_Cnf_H_
#define _XC_Cnf_H_
//=== 头文件
#include <stddef.h>
#include <stdint.h>

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 需要配置的参数

/**
 * @brief   [用户]XCOS基础数据类型
 * @details
 *  默认32位,用于系统滴答计数的数据 \n
 *  一般不用改 \n
 */
#ifndef XCuint_t
#define XCuint_t uint32_t
#endif

/************************************************ 我是分割线 ************************************************/

/**
 * @brief   [内部]最大任务数
 * @details
 *  因为是协作式调度,任务数太多会导致每个任务运行卡顿; \n
 *  这个参数限制最大能注册的任务; \n
 *  数值范围:10~255; \n
 *  默认:100
 */
#ifndef _XC_Cnf_TaskMaxNum
#define _XC_Cnf_TaskMaxNum (100)
#endif

/************************************************ 我是分割线 ************************************************/

/**
 * @brief   [内部]系统每秒滴答数(滴答计数频率)
 * @details
 *  单位Hz,是系统最小的时间单位; \n
 *  最大值是1000000Hz;对应时间是1us; \n
 *  一般设置1000,对应时间为1ms; \n
 */
#ifndef _XC_SysTickPerScond
#define _XC_SysTickPerScond (1000)
#endif

/************************************************ 我是分割线 ************************************************/

/**
 * @brief   [内部]系统滴答计数实现
 * @details
 *  滴答计数是一个累加值,累加时间必须和"_XC_SysTickPerScond"时间一致; \n
 *  此值会在操作中被读取(只读),作为时间计算的依据; \n
 *  系统滴答计数可用2种方式使用: \n
 *--- 方式1:中断累加形式(默认); \n
 *  用一个变量在定时器中累加,每一个滴答时间则+1; \n
 *  宏"_XC_SysTickCount"指向此变量即可; \n
 *  用户需要处理: \n
 *      1.在".c"文件中定义"volatile XCuint_t"类型的全局变量"g_SysTickCount"; \n
 *          可使用宏"_XC_CreateSysTickCount"; \n
 *      2.创建定时器,按"_XC_SysTickPerScond"计数; \n
 *      3.在定时器中累加系统滴答计数:"g_SysTickCount++"; \n
 *          可使用宏"XC_AccSysTickCount()"; \n
 *--- 方式2:计数器形式; \n
 *  因为协程并不需要中断来切换上下文,所以为了使效率最高可以用一个计数器来做系统滴答计数; \n
 *  宏"_XC_SysTickCount"作为一个计数器的函数的返回值(或其本身寄存器值); \n
 *  用户需要处理: \n
 *      1.创建定时器,按"_XC_SysTickPerScond"计数; \n
 *      2.将计数值作为"_XC_SysTickCount"的指向; \n
 */
#ifndef _XC_SysTickCount

#define __XC_SysTickIntAccMode__                // 特殊设置,表示是"中断累加形式"处理系统Tick
#define _XC_SysTickCount         g_SysTickCount // 调用滴答时间计数
extern volatile XCuint_t g_SysTickCount;        // 外部声明全局滴答时间计数

/**
 * @brief   [用户]定义一个Tick计数值
 * @details 注意,需要以全局变量形式定义,在多个框架副本的情况下也只能有一个;
 */
#define _XC_CreateSysTickCount volatile XCuint_t g_SysTickCount = 0

/**
 * @brief   [用户]累加滴答时间计数
 * @details 在中断中调用,按照设置Tick计数用;
 */
#define XC_AccSysTickCount() \
    {                        \
        g_SysTickCount++;    \
    }

#endif

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */

/** 以下是框架功能裁剪 */

/**
 * @brief   配置框架空闲支持
 * @details
 *  默认"1"开启; \n
 *  当此配置为"1"时,在以下状态都满足的情况下可调用空闲回调函数: \n
 *      - 就绪表没有任务;
 *      - 下个唤醒Tick还没有到达时;
 *      - 空闲回调函数有效;
 *  在此配置为"0"时,空闲回调不可使用,且回调配置函数也将无效; \n
 *  关闭框架空闲支持可降低Flash和ram占用(约44Byte存储;4Byte内存); \n
 */
#ifndef _XC_Cnf_IdleSupport
#define _XC_Cnf_IdleSupport (1)
#endif

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 文件结束
#endif
