/*=========================================================|
 | 文件名:  XC_List.h
 | 描述:    定义所有链表操作
 | 版本:    V1.00
 | 日期:    2024/03/18
 | 语言:    C语言
 | 作者:    libertyzx
 | E-mail:  libertyzx@163.com
 +-----------------------------------------------|
 | 开源协议: MIT License
 +-----------------------------------------------|
 +--- 说明
 |  XCOS中需要的链表操作
 +-----------------------------------------------|
 +--- 版本说明:
 |  V1.00:-2024/03/18
 |      1.初始化
 *========================================================*/
//=== 防重复定义
#ifndef _XC_List_H_
#define _XC_List_H_
//=== 头文件
#include "XC_Type.h"

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 数据类型 ===========================================|

/**双向链表节点
 *  32位下占12字节;
 */
typedef struct _XCListNode_t{
    struct _XCListNode_t* pNext;        //指向下个节点
    struct _XCListNode_t* pPrevious;    //指向上个节点
    struct _XCListRoot_t* pRootList;    //指向节点所属的地址
}XCListNode_t;

/**基础双向链表数据类型
 *  只有链表节点和辅助值;
 *  32位下占8字节;
 */
typedef struct{
    XCListNode_t* pNext;                //指向下个节点
    XCListNode_t* pPrevious;            //指向上个节点
}XCListBasic_t;

/**双向链表根节点类型
 *  32位下占12字节;
 */
typedef struct _XCListRoot_t{
    XCListBasic_t RootNode;             //根节点,最后/最初的节点
}XCListRoot_t;

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 函数宏 =============================================|

/************************************************|
 * 描述:    链表是否有效
 * 宏名:    XCList_ListValid
 * 形参[I]: XCListRoot_t* _pList    //链表
 * 返回:    boot
 *  +=返回
 *  | 0     //没有节点
 *  | 1     //有节点
 * 说明:    判断一个链表的是否有效(是否有节点)
 * 例程:    无
 ************************************************/
#define XCList_ListValid(_pList)                ( ((XCListNode_t*)&((_pList)->RootNode)) != ((_pList)->RootNode.pNext) )

/************************************************|
 * 描述:    节点是否到达结尾节点
 * 宏名:    XCList_ReachEndNode
 * 形参[I]: XCListRoot_t* _pList    //链表
 * 形参[I]: XCListNode_t* _pNode    //节点
 * 返回:    boot
 *  +=返回
 *  | 0     //没有到达结尾节点
 *  | 1     //到达结尾节点(节点和链表根地址相同)
 * 说明:    用于遍历链表时,判断遍历的节点是否到达根节点(既是否结束遍历)
 * 例程:    无
 ************************************************/
#define XCList_ReachEndNode(_pList, _pNode)     ( ((XCListNode_t*)&((_pList)->RootNode)) == (_pNode) )

/************************************************|
 * 描述:    获取链表的开始节点
 * 宏名:    XCList_GetListStartNode
 * 形参[I]: XCListRoot_t* _pList    //链表地址(会强制转为链表指针类型)
 * 返回:    XCListNode_t*           //返回节点地址
 * 说明:    得到当前链表的开始地址
 * 例程:    无
 ************************************************/
#define XCList_GetListStartNode(_pList)         ( ((XCListRoot_t*)(_pList))->RootNode.pNext )

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 函数声明 ===========================================|

/**初始化*/
void XCList_Init(XCListRoot_t* pList);      //初始化链表
void XCList_InitNode(XCListNode_t* pNode);  //初始化节点

/**节点操作*/
void XCList_InsertNodePrevious(XCListNode_t* pListNode, XCListNode_t* pNewNode);    //将新节点插入某节点之前
void XCList_InsertNodeNext(XCListNode_t* pListNode, XCListNode_t* pNewNode);        //将新节点插入某节点之后
void XCList_LinkNode(XCListNode_t* pPreviousNode, XCListNode_t* pNextNode);         //连接2个节点
void XCList_Remove(XCListNode_t* pNode);                                            //从链表中移除一个节点

/**链表插入操作*/
void XCList_InsertStart(XCListRoot_t* pList, XCListNode_t* pNewNode);   //节点插入链表开始
void XCList_InsertEnd(XCListRoot_t* pList, XCListNode_t* pNewNode);     //节点插入链表结尾

/**链表操作*/
void XCList_SwapList(XCListRoot_t* pList1, XCListRoot_t* pList2);       //交换2个链表
void XCList_SwapListToNodePrevious(XCListNode_t* pDestNode, XCListRoot_t* pSrcList);    //将一个链表全部移动到一个节点前


/************************************************ 我是分割线 ************************************************/
/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 文件结束
#endif
