/*=========================================================|
 | 文件名: XC_MacroFunc.h
 | 描述  : 通用函数宏定义
 | 版本  : V1.00
 | 日期  : 2024/02/26
 | 语言  : C语言
 | 作者  : libertyzx
 | E-mail: libertyzx@163.com
 +-----------------------------------------------|
 | 开源协议: MIT License
 +-----------------------------------------------|
 +--- 说明
 |  1.实现一些函数宏定义
 +-----------------------------------------------|
 +--- 版本说明
 |  V1.00:-2024/02/26
 |      1.由"XCBase"库中"Macro_Func.h"(V0.3)中更新的函数宏;
 |      2.删除不常用的宏,增加位处理宏;
 *========================================================*/
//=== 防重复定义
#ifndef _XC_MacroFunc_H_
#define _XC_MacroFunc_H_
//=== 头文件
#include "XC_Type.h"

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 二进制位操作 ========================================|

/************************************************|
 * 描述:    二进制0输出(低_Len位为0,剩余位为1)
 * 宏名:    _Bin0Out
 * 参数[I]: _Len    //总共几位0(对应低位,1-32)
 * 返回:    输出数据(最高32位数据),见例程
 * 说明:    见例程
 * 例程:
 *  uint8_t  Cache =  (uchar)_Bin0Out(3);   //8位数据, 输出:_B1111 11000
 *  uint16_t Cache = (ushort)_Bin0Out(3);   //16位数据,输出:_B1111 1111 1111 1000
 *  uint32_t Cache =  (ulong)_Bin0Out(3);   //32位数据,输出:_B1111 1111 1111 1111 1111 1111 1111 1000
 ************************************************/
#define _Bin0Out(_Len)      ( ((uint32_t)(~0) >> (_Len)) << (_Len) )

/************************************************|
 * 描述:    二进制1输出(低_Len位为1,剩余位为0)
 * 宏名:    _Bin1Out
 * 参数[I]: _Len    //总共几位1(对应低位,1-32)
 * 输出:    输出数据(最高32位数据),见例程
 * 说明:    见例程
 * 例程:
 *  uint8_t  Cache =  (uchar)_Bin1Out(1);   //8位数据, 输出:_B1
 *  uint16_t Cache = (ushort)_Bin1Out(3);   //16位数据,输出:_B111
 *  uint32_t Cache =  (ulong)_Bin1Out(9);   //32位数据,输出:_B0001 1111 1111
 ************************************************/
#define _Bin1Out(_Len)      (~(_Bin0Out(_Len)))

/************************************************ 我是分割线 ************************************************/
//=== 对应数据清除&置位 ===================================|

/************************************************|
 * 描述:    清除n位数据
 * 宏名:    _BitClr
 * 参数[I]: _Dest       //需要清除位的数据(最大32位类型)
 * 参数[I]: _Offset     //清除位的偏移(低位开始,0-31)
 * 参数[I]: _BitLen     //清零的位数(1-32)
 * 输出:    无
 * 说明:    见例程
 * 例程:
 *  uint32_t Cache = 0xFFFF;
 *  _BitClr(Cache, 3, 3);       //得到Cache为:0xFFC7
 ************************************************/
#define _BitClr(_Dest, _Offset, _BitLen)    do{ (_Dest) &= ~(_Bin1Out(_BitLen)<<(_Offset)); }while(0)

/************************************************|
 * 描述:    设置n位数据
 * 宏名:    _BitSet
 * 参数[I]: _Dest       //需要设置位的数据(最大32位类型)
 * 参数[I]: _Offset     //设置位的偏移(低位开始,0-31)
 * 参数[I]: _BitLen     //设置的位数(1-32)
 * 输出:    无
 * 说明:    见例程
 * 例程:
 *  uint32_t Cache = 0xF000;
 *  _BitSet(Cache, 3, 3);       //得到Cache为:0xF038
 ************************************************/
#define _BitSet(_Dest, _Offset, _BitLen)    do{ (_Dest) |= (_Bin1Out(_BitLen)<<(_Offset)); }while(0)

/************************************************|
 * 描述:    写n位数据
 * 宏名:    _BitWrite
 * 参数[I]: _Dest       //需要写入目标数据(最大32位类型)
 * 参数[I]: _Offset     //写入数据的偏移(低位开始,0-31)
 * 参数[I]: _Src        //写入的数据
 * 输出:    无
 * 说明:    不会清除原来的数据,只是与上;
 * 例程:
 *  uint32_t Cache = 0xF810;
 *  _BitWrite(Cache, 3, 3);     //得到Cache为:0xF818
 ************************************************/
#define _BitWrite(_Dest, _Offset, _Src)     do{ (_Dest) |= ((_Src)<<(_Offset)); }while(0)

/************************************************|
 * 描述:    读n位数据
 * 宏名:    _BitRead
 * 参数[I]: _Dest       //需要读取的目标数据(最大32位类型)
 * 参数[I]: _Offset     //读取数据的偏移(低位开始,0-31)
 * 参数[I]: _BitLen     //读取的位数(1-32)
 * 输出:    无
 * 说明:    读取的数据会位移到最低位;
 * 例程:
 *  uint32_t Cache = 0xFF5F;
 *  Cache = _BitRead(Cache, 3, 4);  //得到Cache为:0xB
 ************************************************/
#define _BitRead(_Dest, _Offset, _BitLen)   ( ( (_Dest)>>(_Offset) ) & _Bin1Out(_BitLen) )

/************************************************|
 * 描述:    更新n位数据(清除并写数据)
 * 宏名:    _BitUpdate
 * 参数[I]: _Dest       //需要写入目标数据(最大32位类型)
 * 参数[I]: _Offset     //写入数据的偏移(低位开始,0-31)
 * 参数[I]: _BitLen     //设置的位数(1-32)
 * 参数[I]: _Src        //写入的数据
 * 输出:    无
 * 说明:    会清除对应的位数,并将写入的数据和"_BitLen"与来确认输入数据准确性;
 * 例程:
 *  uint32_t Cache = 0xFFFF;
 *  _BitUpdate(Cache, 3, 9, 0xA);       //得到a为:0xF057
 ************************************************/
#define _BitUpdate(_Dest, _Offset, _BitLen, _Src)   \
    do{ \
        _BitClr(_Dest, _Offset, _BitLen);   \
        _BitWrite(_Dest, _Offset, ((_Src) & _Bin1Out(_BitLen)) );   \
    }while(0)

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */

/************************************************|
 * 描述:    频率转换
 * 宏名:    _*Hz2Hz
 * 参数[I]: _n      //对应的频率
 * 输出:    无
 * 说明:    对应频率转Hz,支持*=K,M,G;
 * 例程:    无
 ************************************************/
#define _KHz2Hz(_n)     ((_n)*1000)                 /*KHz转Hz*/
#define _MHz2Hz(_n)     (_KHz2Hz(_n)*1000)          /*MHz转Hz*/
#define _GHz2Hz(_n)     (_MHz2Hz(_n)*1000)          /*GHz转Hz*/

/************************************************|
 * 描述:    获取数组元素个数
 * 宏名:    _ArraySize
 * 参数[I]: _a      //数组名;
 * 输出:    数组元素个数
 * 说明:    无
 *  sizeof(数组名);可以得到整个数组的占字节数;
 *  sizeof(数组名[0]);可以得到数组中单个元素大小;
 *  sizeof(数组名) / sizeof(数组名[0]) 即可得到数组元素大小;
 *  注意,只可用在数组,或数组指针上,若是纯指针或者形参是指针则不支持;
 * 例程:    无
 ************************************************/
#define _ArraySize(_a)  ( sizeof((_a)) / sizeof((_a)[0]) )

/************************************************|
 * 描述:    获取两个数中最大值
 * 宏名:    _Min
 * 参数[I]: _D1      //数值1
 * 参数[I]: _D2      //数值2
 * 输出:    _D1和_D2中大的值;
 * 说明:    无
 * 例程:    无
 ************************************************/
#define _Max(_D1, _D2)  (((_D1)>(_D2)) ? (_D1) : (_D2))

/************************************************|
 * 描述:    获取两个数中最小值
 * 宏名:    _Min
 * 参数[I]: _D1      //数值1
 * 参数[I]: _D2      //数值2
 * 输出:    _D1和_D2中小的值;
 * 说明:    无
 * 例程:    无
 ************************************************/
#define _Min(_D1, _D2)  (((_D1)<(_D2)) ? (_D1) : (_D2))

/************************************************|
 * 描述:    判断一个数是不是2的n次方
 * 宏名:    _TwoN
 * 参数[I]: _V      //数值
 * 输出:    boot    //1表示是2的n次方;0则不是;
 * 说明:    无
 * 例程:    无
 ************************************************/
#define _TwoN(_V)        ( ((_V)!=0) && ( ( (_V) & ((_V)-1) ) == 0) )

/************************************************|
 * 描述:    获取绝对值
 * 宏名:    _ABS
 * 参数[I]: _V      //数值
 * 输出:    输出绝对值
 * 说明:    无
 * 例程:    无
 ************************************************/
#define _ABS(_V)         ((_V)<0?(-(_V)):(_V))

/************************************************|
 * 描述:    设置不使用的变量
 * 宏名:    _Unused
 * 参数[I]: x       //变量名
 * 输出:    无
 * 说明:    不使用的变量用这个宏处理,防止编译器报警;
 * 例程:    无
 ************************************************/
#define _Unused(x)  ((void)(x))

/************************************************|
 * 描述:    从地址获取数据
 * 宏名:    _GetDataFromAddr*
 * 参数[I]: _Addr   //地址(整形变量/常量)
 * 输出:    获取地址中存储的数据
 * 说明:    从地址获取数据(*==8,16,32)
 * 例程:    无
 ************************************************/
#define _GetDataFromAddr8(_Addr)        ( *((__RW uint8_t*)(_Addr)) )       //输出8位数据
#define _GetDataFromAddr16(_Addr)       ( *((__RW uint16_t*)(_Addr)) )      //输出16位数据
#define _GetDataFromAddr32(_Addr)       ( *((__RW uint32_t*)(_Addr)) )      //输出32位数据

/************************************************ 我是分割线 ************************************************/

/************************************************|
 * 描述:    16进制数据转字符
 * 宏名:    _Hex2Char
 * 参数[I]: _Hex        //输入数据0x0-0xF(0-15)
 * 输出:    char        //字符('0'-'9','A'-'F')
 * 说明:    若是数据大于15,则只转换低4位,只输出大写字符;
 * 例程:    无
 ************************************************/
#define _Hex2Char(_Hex)     ("0123456789ABCDEF"[(_Hex)&0x0F])

/************************************************ 我是分割线 ************************************************/

/************************************************|
 * 描述:    由结构体成员获取结构体指针
 * 宏名:    _GetStructAddr
 * 参数[I]: _StructType     //结构体的类型
 * 参数[I]: _MemberName     //结构体成员名(只是名字)
 * 参数[I]: _MemberAddr     //结构体成员地址(指针)
 * 输出:    对应结构体类型的指针;
 * 说明:    注意,只能从1级成员得到结构体的指针;
 * 例程:
 *  typedef struct {
 *      uint32_t aa;
 *      uint32_t bb;
 *  }Test_t;
 *  Test_t Cache;
 *  Test_t *p;
 *  p = _GetStructAddr(Test_t, bb, &Cache->bb);
 *  //"p"的值等于"&Cache"的值;
 ************************************************/
#define _GetStructAddr(_StructType, _MemberName, _MemberAddr)   ( (_StructType*) (((uint8_t*)(_MemberAddr)) - offsetof(_StructType, _MemberName)) )

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 文件结束
#endif
