/*=========================================================|
 | 文件名: XC_Task.h
 | 描述  : 任务的实现
 | 版本  : 1.00
 | 日期  : 2024/03/17
 | 语言  : C语言
 | 作者  : libertyzx
 | E-mail: libertyzx@163.com
 +-----------------------------------------------|
 | 开源协议: MIT License
 +-----------------------------------------------|
 +--- 说明
 |  1.实现了所有协程相关的操作;
 |  2.实现了任务处理需要的操作;
 +-----------------------------------------------|
 +--- 版本说明
 |  V1.00:-2024/03/17
 |      1.协程实现
 *========================================================*/
//=== 防重复定义
#ifndef _XC_Task_H_
#define _XC_Task_H_
//=== 头文件
#include "XC_Type.h"
#include "XC_Time.h"
#include "XC_List.h"

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */

/*协程底层实现("ANSI-C"和"GNU-C"区分)*/
#ifdef __GNUC__
    #include "COR_GNU.h"                    //运行"GNU-C"库
#else
    #include "COR_ANSI.h"                   //运行"ANSI-C"库
#endif

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 宏/枚举 ===================================|

/**函数返回值*/
typedef enum{
    _XC_R_Fail = -1,    //失败
    _XC_R_OK   = 0,     //成功
    _XC_R_Continue,     //继续
}XCRetuen_t;

/**任务状态值(当前协程状态)*/
#define _XC_S_Void              (0)                 //被移除后的状态
#define _XC_S_Run               (1)                 //运行
#define _XC_S_Ready             (2)                 //就绪
#define _XC_S_Delay             (3)                 //[阻塞]延时
#define _XC_S_WaitNotify        (4)                 //[阻塞]等待通知
#define _XC_S_WaitSem           (5)                 //[阻塞]等待信号
#define _XC_S_Suspend           (6)                 //[阻塞]挂起


/**阻塞类型*/
#define _XC_B_NonBlocked        (_B0000_0000)       //没有阻塞(清除阻塞)
#define _XC_B_Blocked           (_B0000_0001)       //阻塞
#define _XC_B_WaitTime          (_B0000_0010)       //等待时间

/**唤醒状态*/
#define _XC_Wake_Non            (0)                 //无唤醒
#define _XC_Wake_Time           (1)                 //时间到达唤醒
#define _XC_Wake_Notify         (2)                 //通知到达唤醒
#define _XC_Wake_TaskResume     (3)                 //任务挂起后恢复
#define _XC_Wake_Sem            (4)                 //信号唤醒

/**锁值*/
#define _XC_Lock_Unlock         (0)                 //没有锁(解锁)
#define _XC_Lock_WaitLock       (1)                 //等待锁定
#define _XC_Lock_Lock           (2)                 //锁定
#define _XC_Lock_WaitUnlock     (3)                 //等待解锁

//=== 类型 ======================================|
typedef COR_BP_t XCBP_t;                //断点类型

/*协程任务控制块(Task Control Block)
 *  32位下占12+4*4+4+4=36
 */
typedef struct _XCTCB_t{
    XCListNode_t ListNode;              //链表节点
    struct _XCOS_t* phXCOS;             //任务所属的框架句柄
    void(*fTask)(struct _XCTCB_t*);     //函数运行入口
    XCuint_t TaskWakeTick;              //任务下个唤醒的时间
    XCBP_t BP;                          //协程断点(Break Point)

    //通知数据
    union{
        uint32_t NotifyData;            //通知的数据(数值)
        void* pNotifyData;              //通知的数据(指针)
    };

    uint8_t Blocked;                    //阻塞状态
    uint8_t WakeType;                   //任务唤醒的类型(_XC_Wake_**)
    uint8_t TaskState;                  //任务状态(_XC_S_**)
}XCTCB_t;

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
/**内部调用的函数声明*/
void XC_TaskBasicInit(XCTCB_t* phTCB);  //基本任务初始化

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */

/*协程块*/

/************************************************|
 * 描述:    [协程]进入
 * 宏名:    XC_Enter
 * 参数[H]: XCTCB_t* phTCB  S//控制块句柄
 * 返回:    void
 * 说明:    协程的启动处理;
 *  必须搭配"XC_Leave"使用;
 ************************************************/
#define XC_Enter(_phTCB)    \
{   \
    /*全局变量转局部变量可加快运行速度*/                \
    XCTCB_t* _phXCTCB = (_phTCB);       /*得到PCB*/     \
    XCBP_t*  _pXCPB   = &_phXCTCB->BP;  /*得到断点*/    \
    /*启动协程*/                                        \
    _COR_Start(*_pXCPB);                /*启动*/

/************************************************|
 * 描述:    [协程]离开
 * 宏名:    XC_Leave
 * 参数[N]: void
 * 返回:    void
 * 说明:    协程块结束;
 *  必须搭配"XC_Enter"使用;
 ************************************************/
#define XC_Leave()  \
    _COR_End();     /*结束*/    \
}

/************************************************ 我是分割线 ************************************************/

/**协程控制*/

/************************************************|
 * 描述:    [协程]让出控制
 * 宏名:    XC_Yield
 * 参数[N]: void
 * 返回:    void
 * 说明:    让出CPU的使用权,跳出协程,下次从此处继续;
 *  必须在协程块中使用;
 ************************************************/
#define XC_Yield()  \
{   \
    _phXCTCB->TaskState = _XC_S_Ready;  /*任务状态:就绪*/   \
    _COR_SetBPBreak(*_pXCPB)            /*设置断点并跳出*/  \
}

/************************************************|
 * 描述:    [协程]获取唤醒超时
 * 函数名:  XC_GetWakeTimeout
 * 参数[I]: void
 * 返回:    boot
 *  +=说明
 *  | 0     //没有超时
 *  | 1     //超时
 * 说明:
 *  用于判断消息和任务通知阻塞唤醒后是否超时;
 *      消息函数:XCSem_BinSemTake
 *      通知函数:XC_WaitNotify
 *  必须在协程块中使用;
 ************************************************/
#define XC_GetWakeTimeout()         (_phXCTCB->WakeType == _XC_Wake_Time)

/************************************************|
 * 描述:    [内联][协程]获取任务运行状态
 * 函数名:  XC_GetTaskState
 * 参数[I]: XCTCB_t* phTCB      //任务TCB
 * 返回:    int32_t
 *  +=说明
 *  | _XC_S_Run         //运行
 *  | _XC_S_Ready       //就绪
 *  | _XC_S_Delay       //[阻塞]延时
 *  | _XC_S_WaitNotify  //[阻塞]等待通知
 *  | _XC_S_WaitSem     //[阻塞]等待信号
 *  | _XC_S_Suspend     //[阻塞]挂起
 * 说明: 任意位置可调用,获取任务运行的状态;
 ************************************************/
__STATIC_INLINE int32_t XC_GetTaskState(XCTCB_t* phTCB)
{
    return(phTCB->TaskState);
}

/************************************************|
 * 描述:    [内联][协程]更新通知数据
 * 函数名:  XC_UpdateNotifyData
 * 参数[I]: XCTCB_t* phTCB      //任务TCB
 * 参数[I]: uint32_t NotifyData //通知数据
 * 返回:    void
 * 说明:
 *  任意位置可调用;
 *  在不使用任务通知的时候,可以用通知数据来传递数据;
 *  此函数用于更新(写)通知数据;
 ************************************************/
__STATIC_INLINE void XC_UpdateNotifyData(XCTCB_t* phTCB, uint32_t NotifyData)
{
    phTCB->NotifyData = NotifyData;
}

/************************************************|
 * 描述:    [内联][协程]读取通知数据
 * 函数名:  XC_ReadNotifyData
 * 参数[I]: XCTCB_t* phTCB      //任务TCB
 * 返回:    uint32_t            //通知的数据
 * 说明:
 *  任意位置可调用;
 *  在不使用任务通知的时候,可以用通知数据来传递数据;
 *  此函数用于读取通知数据;
 ************************************************/
__STATIC_INLINE uint32_t XC_ReadNotifyData(XCTCB_t* phTCB)
{
    return(phTCB->TaskState);
}

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
/**延时处理*/

/************************************************|
 * 描述:    [协程]延时Tick
 * 宏名:    XC_DelayTick
 * 参数[N]: _n
 * 返回:    void
 * 说明:    让出CPU的使用权,延时_n个基础时钟;
 *  必须在协程块中使用;
 ************************************************/
#define XC_DelayTick(_n)    \
{   \
    _phXCTCB->TaskState = _XC_S_Delay;      /*任务状态:延时*/   \
    _phXCTCB->WakeType  = _XC_Wake_Non;     /*清唤醒类型*/      \
    _phXCTCB->Blocked   = _XC_B_WaitTime;   /*等待时间*/        \
    _phXCTCB->TaskWakeTick = (_n);          /*保存时间*/        \
    _COR_SetBPBreak(*_pXCPB);               /*设置断点并跳出*/  \
}

/************************************************|
 * 描述:    [协程]延时
 * 宏名:    XC_Delay_**
 * 参数[N]: _n
 * 返回:    void
 * 说明:    让出CPU的使用权,延时_n个时间;
 *  必须在协程块中使用;
 *  注意:us延时必须要Tick计数在us时基上才能准确的调用;
 ************************************************/
#define XC_Delay_us(_n)     XC_DelayTick(_Time_us2Tick(_n))
#define XC_Delay_ms(_n)     XC_DelayTick(_Time_ms2Tick(_n))
#define XC_Delay_s(_n)      XC_DelayTick(_Time_s2Tick(_n))
#define XC_Delay_min(_n)    XC_DelayTick(_Time_min2Tick(_n))
#define XC_Delay_h(_n)      XC_DelayTick(_Time_h2Tick(_n))
#define XC_Delay_day(_n)    XC_DelayTick(_Time_day2Tick(_n))

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
/**任务通知处理*/

/************************************************|
 * 描述:    [协程]等待通知
 * 宏名:    XC_WaitNotify
 * 参数[I]: XCuint_t TickTimeout    //超时时间
 *  +=参数
 *  | 0     //阻塞死等
 *  | >0    //超时时间
 * 返回:    void
 * 说明:
 *  必须在协程块中使用;
 *  等待一个通知;
 *  唤醒后用"XC_GetTaskTimeout"判断是否超时;
 ************************************************/
#define XC_WaitNotify(_TickTimeout) \
{   \
    _phXCTCB->TaskState = _XC_S_WaitNotify; /*任务状态:等待通知*/   \
    _phXCTCB->WakeType  = _XC_Wake_Non;                             \
    _phXCTCB->Blocked   = _XC_B_Blocked | _XC_B_WaitTime;           \
    _phXCTCB->TaskWakeTick = (_TickTimeout);                        \
    _COR_SetBPBreak(*_pXCPB);               /*设置断点并跳出*/      \
}

/************************************************|
 * 描述:    [协程]获取通知的数据
 * 宏名:    XC_GetNotifyData
 * 参数[N]: void
 * 返回:    XCVar_t //得到通知的数据
 * 说明:
 *  必须在协程块中使用;
 *  通知唤醒后获取通知传递的数据
 ************************************************/
#define XC_GetNotifyData()      (_phXCTCB->NotifyData)

/**任务通知处理-函数声明*/

int32_t XC_SendNotify(XCTCB_t* phTCB, uint32_t NotifyData);     //发送通知

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */

/**任务操作函数-函数声明*/

int32_t XC_TaskSuspend(XCTCB_t* phTCB);     //任务挂起
int32_t XC_TaskResume(XCTCB_t* phTCB);      //任务恢复


/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
/**信号量*/

/************************************************|
 * 描述:    获取信号(消费者)
 * 宏名:    XCSem_BinSemTake
 * 形参[I]: XCSemBin_t* _phSem      //信号句柄
 * 参数[I]: XCuint_t _TickTimeout   //超时时间
 * 返回:    boot
 *  +=返回
 *  | 0     //没有节点
 *  | 1     //有节点
 * 说明:
 *  必须在协程块中使用;
 *  等待获取二值信号;
 *  唤醒后用"XC_GetTaskTimeout"判断是否超时;
 ************************************************/
#define XCSem_BinSemTake(_phSem, _TickTimeout)  \
{   \
    _phXCTCB->TaskWakeTick = (_TickTimeout);    /*超时Tick值*/  \
    /*获取信号*/                                                \
    if(XCSem_BinSemTake_(_phSem, _phXCTCB) == _XC_R_Continue){  \
        _COR_SetBPBreak(*_pXCPB);   /*设置断点并跳出*/          \
    }                                                           \
}

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 文件结束
#endif
