/*=========================================================|
 | 文件名: XC_TimeCompile.h
 | 描述  : 编译时间相关的数据
 | 版本  : V1.00
 | 日期  : 2024/08/12
 | 语言  : C语言
 | 作者  : libertyzx
 | E-mail: libertyzx@163.com
 +-----------------------------------------------|
 | 开源协议: MIT License
 +-----------------------------------------------|
 +--- 说明
 |  1.编译时间格式化输出;
 +-----------------------------------------------|
 +--- 版本说明
 |  V1.00:-2024/08/12
 |      1.从"XC_Time.h"中独立出;
 *========================================================*/
//=== 防重复定义
#ifndef _XC_TimeCompile_H_
#define _XC_TimeCompile_H_
//=== 头文件
#include "XC_Type.h"

/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */

//=== 编译时间相关
/*** 说明
 * 宏"__DATE__"格式是:"MMM DD YYYY" 表示当前编译电脑的日期
 * 如:
 *  "Jan  8 2022"  //2022年8月8日
 *  "Jan 18 2022"  //2022年8月18日
 * 月份值是:
 *  1月: Jan (January)
 *  2月: Feb (February)
 *  3月: Mar (March)
 *  4月: Apr (April)
 *  5月: May (May)
 *  6月: Jun (June)
 *  7月: Jul (July)
 *  8月: Aug (August)
 *  9月: Sep (September)
 *  10月:Oct (October)
 *  11月:Nov (November)
 *  12月:Dec (December)
 * 宏"__TIME__"是时间,格式:"HH:MM:SS" 表示当前编译电脑的时间
 * 如:
 *  23:33:23    //23点33分23秒
 *  03:07:06    //3点7分6秒
 * 注意:
 *  年数字是4位10进制数据,需要16位宽及以上类型保存,
 *  其他(月日时分秒)都是2位10进制数据,需要8位宽及以上类型保存;
 ***/
    //获取年数字
    #define _Compile_GetYear    /*输出年*/  \
        ( ((__DATE__[7]-'0')*1000) + ((__DATE__[8]-'0')*100) + ((__DATE__[9]-'0')*10) + (__DATE__[10]-'0') )
    //获取月数字
    #define _Compile_GetMonth   /*输出月份*/    (   \
        __DATE__[2]=='c' ? 12 : \
        __DATE__[2]=='v' ? 11 : \
        __DATE__[2]=='t' ? 10 : \
        __DATE__[2]=='p' ? 9 : \
        __DATE__[2]=='g' ? 8 : \
        __DATE__[2]=='l' ? 7 : \
        __DATE__[2]=='n' ? (__DATE__[1]=='u' ? 6 : 1) : \
        __DATE__[2]=='y' ? 5 : \
        __DATE__[2]=='r' ? (__DATE__[1]=='p' ? 4 : 3) : 2)
    //获取日期数字
    #define _Compile_GetDate    /*输出日期*/    \
        ( (__DATE__[4]==' ' ? 0 : (__DATE__[4]-'0')) * 10 + (__DATE__[5]-'0') )
    //获取时|分|秒
    #define _Compile_GetHour    /*输出小时*/    ( ((__TIME__[0]-'0')*10) + (__TIME__[1]-'0') )
    #define _Compile_GetMin     /*输出分钟*/    ( ((__TIME__[3]-'0')*10) + (__TIME__[4]-'0') )
    #define _Compile_GetSec     /*输出秒*/      ( ((__TIME__[6]-'0')*10) + (__TIME__[7]-'0') )

//=== 获取一个编译日期时间的总字符串(编译时间格式(年月是时分秒):20220803230638)
    #define _Compile_GetDateTimeStr /*获取日期时间字符串(14个数字字符串+1个结束符,总共15个字节)*/   {   \
        /*年*/  __DATE__[7], __DATE__[8], __DATE__[9], __DATE__[10],    \
        /*月*/  (_Compile_GetMonth/10)+'0', (_Compile_GetMonth%10)+'0', \
        /*日*/  (__DATE__[4]==' ' ? '0' : '1'), __DATE__[5],    \
        /*时*/  __TIME__[0], __TIME__[1],   \
        /*分*/  __TIME__[3], __TIME__[4],   \
        /*秒*/  __TIME__[6], __TIME__[7],   \
        /*结束*/    '\0' }

//=== 获取十进制表示的日期(8位数字,20230818表示2023年8月18号)
    #define _Compile_GetDateDec /*获取十进制表示的日期*/    ((_Compile_GetYear*100+_Compile_GetMonth)*100+_Compile_GetDate)

//=== 获取十进制表示的时间(6位数字,100345表示10点03分45秒)
    #define _Compile_GetTimeDec /*获取十进制表示的时间*/    ((_Compile_GetHour*100+_Compile_GetMin)*100+_Compile_GetSec)


/*
 ************************************************************************************************************|
 ************************************************ 我是分割线 ************************************************|
 ************************************************************************************************************|
 */
//=== 文件结束
#endif
